OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_hmac.c
// HMAC - NIST CAVS 11.0
NRF_SECTION_ITEM_REGISTER(test_vector_hmac_data, test_vector_hmac_t test_vector_hmac256_0) =
{
    .p_hmac_info        = &g_nrf_crypto_hmac_sha256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "SHA256 key_len=40 message_len=128",
    .p_input            = "b1689c2591eaf3c9e66070f8a77954ffb81749f1b00346f9dfe0b2ee905dcc288baf4a92de3f4001dd9f44c468c3d07d6c6ee82faceafc97c2fc0fc0601719d2dcd0aa2aec92d1b0ae933c65eb06a03c9c935c2bad0459810241347ab87e9f11adb30415424c6c7f5f22a003b8ab8de54f6ded0e3ab9245fa79568451dfa258e",
    .p_key              = "9779d9120642797f1747025d5b22b7ac607cab08e1758f2f3a46c8be1e25c53b8c6a8f58ffefa176",
    .p_expected_output  = "769f00d3e6a6cc1fb426a14a4f76c6462e6149726e0dee0ec0cf97a16605ac8b"
};

// HMAC - NIST CAVS 11.0
NRF_SECTION_ITEM_REGISTER(test_vector_hmac_data, test_vector_hmac_t test_vector_hmac_sha256_1) =
{
    .p_hmac_info        = &g_nrf_crypto_hmac_sha256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "SHA256 key_len=45 message_len=128",
    .p_input            = "53cb09d0a788e4466d01588df6945d8728d9363f76cd012a10308dad562b6be093364892e8397a8d86f1d81a2096cfc8a1bbb26a1a75525ffebfcf16911dadd09e802aa8686acfd1e4524620254a6bca18dfa56e71417756e5a452fa9ae5aec5dc71591c11630e9defec49a4ecf85a14f60eb854657899972ea5bf6159cb9547",
    .p_key              = "b763263dc4fc62b227cd3f6b4e9e358c21ca036ce396ab9259c1bedd2f5cd90297dc703c336eca3e358a4d6dc5",
    .p_expected_output  = "737301dea93db6bcbadd7bf796693961317ca680b380416f12f466f06526b36b"
};

// HMAC - NIST CAVS 11.0
NRF_SECTION_ITEM_REGISTER(test_vector_hmac_data, test_vector_hmac_t test_vector_hmac_sha256_2) =
{
    .p_hmac_info        = &g_nrf_crypto_hmac_sha256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "SHA256 key_len=64 message_len=128",
    .p_input            = "ed4f269a8851eb3154771516b27228155200778049b2dc1963f3ac32ba46ea1387cfbb9c39151a2cc406cdc13c3c9860a27eb0b7fe8a7201ad11552afd041e33f70e53d97c62f17194b66117028fa9071cc0e04bd92de4972cd54f719010a694e414d4977abed7ca6b90ba612df6c3d467cded85032598a48546804f9cf2ecfe",
    .p_key              = "992868504d2564c4fb47bcbd4ae482d8fb0e8e56d7b81864e61986a0e25682daeb5b50177c095edc9e971da95c3210c376e723365ac33d1b4f391817f4c35124",
    .p_expected_output  = "2f8321f416b9bb249f113b13fc12d70e1668dc332839c10daa5717896cb70ddf"
};

// HMAC - NIST CAVS 11.0
NRF_SECTION_ITEM_REGISTER(test_vector_hmac_data, test_vector_hmac_t test_vector_hmac_sha256_3) =
{
    .p_hmac_info        = &g_nrf_crypto_hmac_sha256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "SHA256 key_len=74 message_len=128",
    .p_input            = "b9e944e0b42d0ff454f7f8aa24f00e9ee039058ce4094111e39731b6dc3ade2a4acec4cf9c5be078e4f10a72d3d685c1e5e4d5abd92cd07b64dff87f266f0853ddf1cd61d9c637a9b07ab0be32ecac119faf827218b17ad4541a27519477f76ed918089f54b63d0e1e5a92982979ac187764b5e989e066a61b1065340e9cd203",
    .p_key              = "81574323c973540719d192833ddb51f13a52dcbae294aebea51be5f6aa47f3571f5d97facdcf0c7befbe809f44bdc73963d8514e4fd559774bb96087ef8eda6e7c64275d6d96c42b4e4e",
    .p_expected_output  = "514bd18495f6de0e237054b8e3ba1a74c3fada4279ad6b8550f3a14712c528df"
};

// RFC 4231 HMAC-SHA Test Case 1
NRF_SECTION_ITEM_REGISTER(test_vector_hmac_data, test_vector_hmac_t test_vector_hmac_sha256_rfc1) =
{
    .p_hmac_info        = &g_nrf_crypto_hmac_sha256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "SHA256 key_len=20 message_len=8",
    .p_input            = "4869205468657265",
    .p_key              = "0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b0b",
    .p_expected_output  = "b0344c61d8db38535ca8afceaf0bf12b881dc200c9833da726e9376c2e32cff7"
};

// RFC 4231 HMAC-SHA Test Case 2
NRF_SECTION_ITEM_REGISTER(test_vector_hmac_data, test_vector_hmac_t test_vector_hmac_sha256_rfc2) =
{
    .p_hmac_info        = &g_nrf_crypto_hmac_sha256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "SHA256 key_len=4 message_len=28",
    .p_input            = "7768617420646f2079612077616e7420666f72206e6f7468696e673f",
    .p_key              = "4a656665",
    .p_expected_output  = "5bdcc146bf60754e6a042426089575c75a003f089d2739839dec58b964ec3843"
};

// RFC 4231 HMAC-SHA Test Case 3
NRF_SECTION_ITEM_REGISTER(test_vector_hmac_data, test_vector_hmac_t test_vector_hmac_sha256_rfc3) =
{
    .p_hmac_info        = &g_nrf_crypto_hmac_sha256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "SHA256 key_len=20 message_len=50",
    .p_input            = "dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd",
    .p_key              = "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
    .p_expected_output  = "773ea91e36800e46854db8ebd09181a72959098b3ef8c122d9635514ced565fe"
};

// RFC 4231 HMAC-SHA Test Case 4
NRF_SECTION_ITEM_REGISTER(test_vector_hmac_data, test_vector_hmac_t test_vector_hmac_sha256_rfc4) =
{
    .p_hmac_info        = &g_nrf_crypto_hmac_sha256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "SHA256 key_len=25 message_len=50",
    .p_input            = "cdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcdcd",
    .p_key              = "0102030405060708090a0b0c0d0e0f10111213141516171819",
    .p_expected_output  = "82558a389a443c0ea4cc819899f2083a85f0faa3e578f8077a2e3ff46729665b"
};

// RFC 4231 HMAC-SHA Test Case 6
NRF_SECTION_ITEM_REGISTER(test_vector_hmac_data, test_vector_hmac_t test_vector_hmac_sha256_rfc6) =
{
    .p_hmac_info        = &g_nrf_crypto_hmac_sha256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "SHA256 key_len=131 message_len=54",
    .p_input            = "54657374205573696e67204c6172676572205468616e20426c6f636b2d53697a65204b6579202d2048617368204b6579204669727374",
    .p_key              = "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
    .p_expected_output  = "60e431591ee0b67f0d8a26aacbf5b77f8e0bc6213728c5140546040f0ee37f54"
};

// RFC 4231 HMAC-SHA Test Case 7
NRF_SECTION_ITEM_REGISTER(test_vector_hmac_data, test_vector_hmac_t test_vector_hmac_sha256_rfc7) =
{
    .p_hmac_info        = &g_nrf_crypto_hmac_sha256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "SHA256 key_len=131 message_len=152",
    .p_input            = "5468697320697320612074657374207573696e672061206c6172676572207468616e20626c6f636b2d73697a65206b657920616e642061206c6172676572207468616e20626c6f636b2d73697a6520646174612e20546865206b6579206e6565647320746f20626520686173686564206265666f7265206265696e6720757365642062792074686520484d414320616c676f726974686d2e",
    .p_key              = "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
    .p_expected_output  = "9b09ffa71b942fcb27635fbcd5b0e944bfdc63644f0713938a7f51535c3a35e2"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_HMAC_SHA256)
#if NRF_MODULE_ENABLED(NRF_CRYPTO_HMAC_SHA512)

